RubyRailsLevel1/rails_studio/events/app/views/events/show.html.erb

SELECT COUNT(*) FROM "registrations"  WHERE "registrations"."event_id" = ?  [["event_id", 1]]
---
  <h3>Registrations</h3>
  <%= link_to pluralize(@event.registrations.size, 'registration'),
              event_registrations_path(@event) %>