RubyRailsLevel1/rails_studio/flix/app/controllers/movies_controller.rb

	def index
		#@movies = ['No Country For Old Men','Fargo','The Man Who Had No Name']
		@movies = Movie.all
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-04-05 20:19:09.945091')  ORDER BY released_on desc