RubyRailsLevel1/rails_studio/flix/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["title", "Iron Man1"], ["updated_at", "2015-03-29 03:27:42.069111"]]
---
  def update
    @movie = Movie.find(params[:id])

    if @movie.update(movie_params)