RubyRailsLevel1/rails_studio/flix/app/controllers/reviews_controller.rb

  	def create

  		@review = @movie.reviews.new(review_params)

 		if @review.save
---
INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "gggg"], ["created_at", "2015-04-05 21:29:51.947476"], ["movie_id", 1], ["name", "Yes"], ["stars", 2], ["updated_at", "2015-04-05 21:29:51.947476"]]

  def edit
    @review = @movie.reviews.find(params[:id])
---
SELECT  "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", 1]]

  def update
    #@review =
    #@review.id = params[:id]

    if @movie.reviews.update(params[:id],review_params)
---
UPDATE "reviews" SET "stars" = ?, "updated_at" = ? WHERE "reviews"."id" = 1  [["stars", 2], ["updated_at", "2015-04-06 01:37:57.430477"]]