RubyRailsLevel1/rails_studio/flix before redesign/flix/app/views/movies/index.html.erb


<h1> <%= pluralize(@movies.size,'Movie') %> </h1>
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-03-26 20:21:53.633677')  ORDER BY released_on
SELECT COUNT(count_column) FROM (SELECT  1 AS count_column FROM "movies"  LIMIT 1) subquery_for_count