RubyRailsLevelI/rails_ii_studio/flix/app/controllers/favorites_controller.rb

  def create

    @movie.favorites.create!(user: current_user)
---
INSERT INTO "favorites" ("created_at", "movie_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2015-07-18 15:57:30.794725"], ["movie_id", 1], ["updated_at", "2015-07-18 15:57:30.794725"], ["user_id", 3]]