RubyRailsLevelI/rails_ii_studio/flix/app/controllers/movies_controller.rb

SELECT  "favorites".* FROM "favorites"  WHERE "favorites"."user_id" = ? AND "favorites"."movie_id" = 1 LIMIT 1  [["user_id", 3]]
SELECT "genres".* FROM "genres" INNER JOIN "characterizations" ON "genres"."id" = "characterizations"."genre_id" WHERE "characterizations"."movie_id" = ?  [["movie_id", 1]]
---
  def show

    @fans = @movie.fans
    @genres = @movie.genres

    if current_user
      @current_favorite = current_user.favorites.find_by(movie_id: @movie.id)

SELECT  "movies".* FROM "movies"  WHERE "movies"."slug" = 'catwoman' LIMIT 1
---
  def set_movie
    @movie = Movie.find_by!(slug: params[:id])