RubyRailsLevelI/rails_ii_studio/flix/app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "stars", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "decent"], ["created_at", "2015-07-16 20:01:10.926690"], ["movie_id", 1], ["stars", 5], ["updated_at", "2015-07-16 20:01:10.926690"], ["user_id", 3]]
---
  def create
    @review = @movie.reviews.new(review_params)
    @review.user = current_user
    if @review.save