RubyRailsLevelI/rails_ii_studio/flix/app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "email", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["password_digest", "$2a$10$Ckx2zQPOLMmAM3jzD1Vfve6kGR0aPEDrotp8CCf79ELvg2LlWbZfe"], ["updated_at", "2015-07-14 14:47:39.836866"]]
---
  def update

    if @user.update(user_params)