RubyRailsLevel1/rails_studio/events/app/controllers/events_controller.rb

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "events" SET "name" = ?, "starts_at" = ?, "updated_at" = ? WHERE "events"."id" = 1  [["name", "Bug Smash"], ["starts_at", "2015-07-06 07:46:00.000000"], ["updated_at", "2015-03-28 09:13:57.269887"]]
---
  def update
    @event = Event.find(params[:id])

       if @event.update(event_params)

INSERT INTO "events" ("capacity", "created_at", "description", "image_file_name", "location", "name", "price", "starts_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(event_params)

    if @event.save