RubyRailsLevel1/rails_studio/events/app/controllers/registrations_controller.rb

INSERT INTO "registrations" ("created_at", "email", "event_id", "how_heard", "name", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-04-05 18:00:53.930843"], ["email", "larryy@stooges.com"], ["event_id", 1], ["how_heard", "Twitter"], ["name", "Larry"], ["updated_at", "2015-04-05 18:00:53.930843"]]
---
  def create
  	@registration = @event.registrations.new(registration_params)

  	if @registration.save

SELECT  "events".* FROM "events"  WHERE "events"."id" = ? LIMIT 1  [["id", 1]]
---
  def set_event
  	@event = Event.find(params[:event_id])