RubyRailsLevel1/rails_studio/flix/app/views/movies/index.html.erb


<h1> <%= pluralize(@movies.size,'Movie') %> </h1>
---
SELECT "movies".* FROM "movies"  WHERE (released_on <= '2015-04-05 20:19:09.945091')  ORDER BY released_on desc