RubyRailsLevel1/rails_studio/flix/app/views/movies/show.html.erb

  <p>
    <%= link_to pluralize(@movie.reviews.size, "review"),
                  movie_reviews_path(@movie) %><br/>
---
SELECT "reviews".* FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
SELECT COUNT(*) FROM "reviews"  WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]