RubyRailsLevel1/rails_studio_2/flix_per2/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies"  WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "movies" SET "title" = ?, "updated_at" = ? WHERE "movies"."id" = 1  [["title", "Iron Man 3"], ["updated_at", "2015-07-11 13:12:48.740718"]]
---
  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)